// Kaomoji data and categories

export const defaultKaomojis: string[] = [
    // Happy
    "(≧◡≦)", "◝(ᵔᗜᵔ)◜", "(˶ᵔᗜᵔ˶)ﾉﾞ", "(^_^)v", "(o˘◡˘o)", "(ﾉ≧ڡ≦)", "(｡•̀ᴗ-)✧",
    // Cute
    "(｡♥‿♥｡)", "(づ｡◕‿‿◕｡)づ", "(づ￣ 3￣)づ", "(。・ω・。)", "(⸝⸝> ᴗ•⸝⸝)", "(˶ᵔ ᵕ ᵔ˶)",
    // Angry
    "( •̀ ᴖ •́ )", "ψ(｀∇´)ψ", "(ง •̀_•́)ง", "(ノಠ益ಠ)ノ彡┻━┻",
    // Nerdy
    "(•_•) ( •_•)>⌐■-■ (⌐■_■)", "(ʘ‿ʘ)", "( ͡° ᴥ ͡°)", "( ͡° ͜ʖ ͡°)つ──☆*:・ﾟ",
    // Sad
    "(｡•́︿•̀｡)", "(ಥ﹏ಥ)", "(つ╥﹏╥)つ", "(｡ᵕ ◞ _◟)",
    // In love
    "(⸝⸝ ♡﹏♡⸝⸝)", "( ˘ ³˘)♥", "(♡°▽°♡)", "(｡･ω･｡)ﾉ♡",
    // Sleepy
    "(˘ω˘)", "(ᴗ˳ᴗ)ᶻ𝗓𐰁", "(˘_˘) (˘_˘) (˘_˘) zzz",
    // Pets
    "(=^･ω･^=)", "૮･ﻌ･ა", "ฅ^>⩊<^ ฅ",
    // Nature
    "⋆⭒˚.⋆🪐 ⋆⭒˚.⋆", "🌿⚘.⋆˚࿔🍃༄", "⋆.˚✮🔥 🔥✮˚.⋆"
];

export const kaomojiCategories: Record<string, string[]> = {
    happy: [
        "(≧◡≦)", "◝(ᵔᗜᵔ)◜", "(˶ᵔᗜᵔ˶)ﾉﾞ", "(^_^)v", "(o˘◡˘o)", "(^o^)",
        "(ﾉ≧ڡ≦)", "(｡•̀ᴗ-)✧", "( ͡° ͜ʖ ͡°)", "(｡•́‿•̀｡)", "(✧ω✧)", "( ꈍ◡ꈍ)", "ദ്ദി(˵ •̀ ᴗ - ˵ ) ✧",
        "( ˶ˆᗜˆ˵ )", "৻(  •̀ ᗜ •́  ৻)"
    ],
    angry: [
        "( •̀ ᴖ •́ )", "ψ(｀∇´)ψ", "(¬_¬)", "(｡•̀ ⤙ •́ ｡ꐦ) !!!", "⁽⁽(੭ꐦ •̀Д•́ )੭*⁾⁾", "(ง •̀_•́)ง",
        "(ノಠ益ಠ)ノ彡┻━┻", "(¬_¬\")", "ヾ(๑╹◡╹)ﾉ🔪", "( ,,⩌'︿'⩌ꐦ,,)", "( ◺˰◿ )", "ς(≖_≖ )ﾉ🔪",
        "(˶˃ᆺ˂˶)"
    ],
    cute: [
        "(｡♥‿♥｡)", "(づ｡◕‿‿◕｡)づ", "(づ￣ 3￣)づ", "(。・ω・。)", "( •̯́ ₃ •̯̀)", "(⸝⸝> ᴗ•⸝⸝)",
        "(｡•́︿•̀｡)", "(｡•̀ᴗ-)✧", "(ʕ•ᴥ•ʔ)", "(｡•́‿•̀｡)", "₍^. .^₎Ⳋ", "(˶ᵔ ᵕ ᵔ˶)", "≽^•⩊•^≼"
    ],
    nerdy: [
        "(•_•) ( •_•)>⌐■-■ (⌐■_■)", "📐e = ∑∞ⁿ⁼⁰ ¹ₙ🤓",  "(￣(工)￣)",
        "( ͡° ᴥ ͡°)", "( ͡° ͜ʖ ͡°)つ──☆*:・ﾟ", "(╭ರ_•́)", "(⌐■_■)",
    ],
    sad: [
        "(◡_◡)", "(˚ ˃̣̣̥⌓˂̣̣̥  )づ♡", "(｡•́︿•̀｡)", "(ಥ﹏ಥ)", "(¬_¬\")", ".·°՞(っ-ᯅ-ς)՞°·.",
        "(つ╥﹏╥)つ", "(｡ᵕ ◞ _◟)", "(⇀‸↼‶)", "૮(˶╥︿╥)ა", "૮(◞ ‸ ◟ )ა", "(っ╥﹏╥ς)"
    ],
    inlove: [
        "(⸝⸝ ♡﹏♡⸝⸝)", "(｡♥‿♥｡)", "(づ￣ 3￣)づ", "(づ ᴗ _ᴗ)づ♡",
        "( ˘ ³˘)♥", "(♡°▽°♡)", "(｡･ω･｡)ﾉ♡", "(っ˶ ˘ ᵕ˘)ˆᵕ ˆ˶ς)", "ε(´｡•᎑•`)っ 💕",
        "(˶  >   ₃  < ˶)", "(˶ᵔ ᵕ ᵔ˶) <3"
    ],
    sleepy: [
        "(˘ω˘)", "(ᴗ˳ᴗ)ᶻ𝗓𐰁", "(˘_˘) (˘_˘) (˘_˘) zzz", "(っ˕ -｡)ᶻ z 𐰁","(￣o￣) zzZZ",
        "( - ⌓ - ) ᶻ z 𐰁", "(つω`｡)", "꜀( ꜆-ࡇ-)꜆ ᶻ z 𐰁"
    ],
    pets: [
        "(=^･ω･^=)", "(=^･ｪ･^=)", "૮･ﻌ･ა", "૮꒰˵• ﻌ •˵꒱ა", "૮ – ﻌ–ა", "ദ്ദി◝ ⩊ ◜.ᐟ",
        "≽(•⩊ •マ≼", "૮⍝• ᴥ •⍝ა", "૮₍´｡ᵔ ꈊ ᵔ｡`₎ა", "≽^•⩊•^≼", "⚞^. .^⚟", "ฅ^>⩊<^ ฅ"
    ],
    nature: [
        ".𖥔 ݁ ˖🛸── .✦", "⋆⭒˚.⋆🪐 ⋆⭒˚.⋆", "⋆.ೃ࿔* :･🌱⋆.ೃ࿔* :･", "🌿⚘.⋆˚࿔🍃༄", "🌊⋆｡𖦹 °.🐚⋆❀˖°🫧",
        "🪼⋆｡𖦹°🫧⋆.ೃ࿔*:･", "⋆.ೃ࿔.𖥔 ݁ ˖*:･༄", "°:•.🐠*.•🪸.•:°", "⋆˚࿔🌕⋆˚࿔"
    ],
    all: [] // Will be filled with all kaomojis below
};

// Fill 'all' with all unique kaomojis from categories and default
kaomojiCategories.all = Array.from(new Set(
    Object.values(kaomojiCategories).flat().concat(defaultKaomojis)
));
